{
  "data": [
    {
      "title": "I never returned a laptop I borrowed from High School",
      "confession": "This was back in the late 90's/early 2000's. I was the teachers helper in the Computer Technology class my senior year because I had enough credits to graduate, however they didn't let you do half days so this is what I chose to do with my time. The teacher was a great guy, nothing against him. I was in charge of keeping track of the laptops and signing them out. Mind you this was over 20 years ago so they were like IBM laptops with Pentium 2's and 2gb hard drives. For some reason I thought the school owed me something for not letting me leave early and work (The other surrounding schools if you had enough credits your senior year you only had to go half a day as long as your parents signed off saying it was for employment). I borrowed a laptop because my Pentium 1 PC could not do a lot of things I needed for school. I fudged the records to show that it was never taken out, and I was trusted so much it was never checked. They found out it was missing 2 years later but only by my sister telling me about it since she was a freshman at the time.",
      "color": "#f5a43a",
      "viewCount": 239
    },
    {
      "title": "Acidentally charged a customer 4$ too much, and purporsefully didn’t tell her.",
      "confession": "This might sound very stupid, but i for some reason feel really bad about this. I work in a gas station and today 20 minutes before closing the shop at 10 pm, a customer came in and wanted to buy 2 bags of candy 4$ each. Before her another customer came in to buy a bag of candy, but changed her mind. Me and the customer small talked a little and she seemed very nice, so i scanned her two bags of candy and she paid. Right as she paid i realised that i had put a bag of candy too much on her payment, but decided not to tell her because i was too tired to go through the refund proces. She looked like she belongs to the upper middle class and propably won’t realise my mistake, but i still instantly felt bad about not telling her about my mistake, and letting her walk out of the shop because of me being tired (or lazy).",
      "color": "#f5c16c",
      "viewCount": 1098
    },
    {
      "title": "I stole McDonald’s monopoly tickets to get free food",
      "confession": "I live in Canada and every year, during a month, McDonald’s has a game that you can win plenty of prices, including free food, by collecting monopoly tickets on food boxes (I think this is only in Canada). So when I was 15, I was working at McDonald’s and I purposefully drop a full load of BigMac boxes and told the manager that I was going to throw them away in the recycling bin in the back. I went there and proceed to tear every monopoly tickets on each box, and kept the winning ones. There was probably 150 boxes with 2 tickets per box (you have one in five chances to win so I ended up with a bunch of winning ones). So for the next few months, I went to another McDonald’s and order the free food with the tickets. I probably stole around 300-400$ worth of food.",
      "color": "#c2aa7c",
      "viewCount": 2678
    },
    {
      "title": "I stole a kids fidget spinner in 5th grade and threw it away",
      "confession": "This kid was obviously troubled and his parents clearly were physically abusing him, i was 9 years old so i didn’t catch on to this at the time and he was just the token “weird kid” but on the last day of school he was all exited that he finally got a fidget spinner from his mom, i can’t remember 100% but i think he said something that made me a little mad so naturally being a kid i took his fidget spinner and hid it inside the trashcan; about an hour before the school day ended he realized it had gone missing and started sobbing and freaking out like full on hitting himself in the head and shaking, i immediately felt bad but people would notice if i went digging in the trashcans so i tried to ignore it but one of the last things he said when we were walking out of the school was that whoever took it had no idea what they’d done to him and now i can only assume with a reaction like that his parents were gonna hurt him for “losing” it. i’m a freshman in highschool now but this haunts me everyday, i haven’t seen him since and have no idea where he ended up but i truly believe i deserve to burn in hell for this and i have to live the rest of my life knowing i may have caused this poor kid to get abused that night.",
      "color": "#0a4faa",
      "viewCount": 987
    },
    {
      "title": "Pressured my friend to throw a rock into a window.",
      "confession": "Basically we were outside at a courtyard, my school is next to some buildings so 11 year old me thought it would be funny to throw rocks at windows, we went to a secluded area between 2 yards, I was on the lookout. A teacher was watching so when she went on her phone I urged my friend to throw a rock at the window and he did a few times. The home owner called the teacher and my friend got in trouble, since I ran away I never didn't.",
      "color": "#148664",
      "viewCount": 4764
    },
    {
      "title": "i tried to teach the kid i nanny how to drive… she was 12… 😐🤷🏼‍♀️",
      "confession": "so you probably read the title and think why the fuck would anyone do this, and honestly these kids are the most mature kids i’ve ever met. (not an excuse) but anyways, i nanny two kids and had just dropped off the oldest at their therapy session and had time to waste since it was an hour away from home so i drove to a big parking lot and decided to try and teach the younger one how to drive. she was going a little fast and told her to slow down, she did. then she went around a corner a bit too fast and instead of breaking she hit and ran over a parking street sign. it was in the back of a building, but as soon as she ran it over we chinese fire drill style run into the others seat and i drove off. she literally plowed down this street sign, fully knocked off its post. i ended up never getting in any type of trouble for it. long story short, she ended up tearing through my radiator and costing me $500 in repairs to my personal vehicle. it ended up going through insurance because i told her dad and everyone that i hit a big tree branch one night when it was storming really bad. she never told her sister, and her dad still thinks my car broke from a tree branch. the repairs would have cost me $5800…",
      "color": "#9d10b5",
      "viewCount": 375
    },
    {
      "title": "I took a sip out of a girls drink without her knowing.",
      "confession": "I was at party in like middle school and withour her knowledge I drank a little out of her drink. We were very close friends years ago , so I thought it was appropriate to do it. This is very tame and perhaps stupid but it has always has been tormenting my mind and I regret it.",
      "color": "#aafc90",
      "viewCount": 3598
    },
    {
      "title": "Pressured my friend to throw a rock into a window.",
      "confession": "Basically we were outside at a courtyard, my school is next to some buildings so 11 year old me thought it would be funny to throw rocks at windows, we went to a secluded area between 2 yards, I was on the lookout. A teacher was watching so when she went on her phone I urged my friend to throw a rock at the window and he did a few times. The home owner called the teacher and my friend got in trouble, since I ran away I never didn't.",
      "color": "#6965d2",
      "viewCount": 6348
    },
    {
      "title": "I threw my father's telephone into the Grand Canyon",
      "confession": "When I was 10 or 11, my whole family went on a trip around Arizona. Of course, during this road trip, we ended up stopping by Grand Canyon National Park, where we camped for a couple days. So eventually we hiked up to Yavapai Point to get a family photo. After we took the photo, while my mother and father were messing with the camera and enjoying the view, I, for some reason, decided to take my dad's telephone out of his hiking bag and throw it over the side. I'm not quite sure how nobody saw me doing this, but it fell a solid few hundred feet until I couldn't see it anymore. Obviously my dad noticed after a few hours that his cell phone was missing and spent the rest of the day looking for it. At this point I was seriously regretting my stupid impulsive decision but I kept my mouth shut. He got really upset because all of his old friend's contacts and photos were on this phone so the rest of the trip was ruined. When we got back, apparently his boss had been trying to call him nonstop for days over some sort of urgent work issue. I'm pretty sure this had something to do with my dad being fired a few months later. I'm writing this so many years later because I still feel really bad about this and I can't help but think that my life would be drastically different if I hadn't made that stupid decision.",
      "color": "#efdb59",
      "viewCount": 2349
    },
    {
      "title": "I threw eggs from the 16th floor of my apartment to maintain peace and quiet.",
      "confession": "I used to live on the 16th floor of an apartment building. There was a pub on the ground floor and people would often congregate late at night in the street in front of the pub entrance. This was a hinderance to residents because we would wake up at 1 or 2 in morning to drunk people talking outside. My apartment had 2 balconies on 2 sides of the building so I often looked down on people grouping together on both sides of the building. I got fed up with it and decided to drop an egg where a group of people were chatting. They immediately dispersed and i could enjoy my sleep again I did this on another occasion and again it worked. I started buying more eggs and it became a habit that I practiced for about 6 months. No one had a clue it was me and I even went to the pub and over heard people chatting about eggs being dropped from balconies in the building. Needless to say i used to maintain peace and quiet by dropping eggs from my balconies.",
      "color": "#d98d80",
      "viewCount": 7483
    },
    {
      "title": "Lied to get out of a school project and ended up stuck in therapy for a year.",
      "confession": "When I was a senior in high school, in the beginning of the school year we had to do a project where we had to do a presentation and show how to do something step by step. I picked making chocolate chip cookies so when I was going to present I had to show a step by step on how to make them so I had to bring in milk, eggs, bowls etc. We had 3 weeks to plan for the project but it was the day I had to present and I didn’t prepare or bring anything. So as soon as I got to school I went into my English class and told my teacher I didn’t have anything because my mom and dad got into a fight two night before and my dad kicked us out and we’ve been living in a hotel. She said it was okay and that she would give me credit for my written part. The next week when I was in 3rd period I get called into the office. The school therapist was there and told me she wanted to talk to me. She asked me if everything was okay at home and I didn’t wanna have to do my project and get caught lying so I kept with the story that my dad kicked us out. I started crying and the therapist told me she would like to see me once a week. So I went for my whole senior year once a week to therapy to avoid doing one project.",
      "color": "#4d7bce",
      "viewCount": 8347
    },
    {
      "title": "I lied to an old employer about my previous pay rate.",
      "confession": "I used to live on the 16th floor of an apartment building. There was a pub on the ground floor and people would often congregate late at night in the street in front of the pub entrance. This was a hinderance to residents because we would wake up at 1 or 2 in morning to drunk people talking outside. My apartment had 2 balconies on 2 sides of the building so I often looked down on people grouping together on both sides of the building. I got fed up with it and decided to drop an egg where a group of people were chatting. They immediately dispersed and i could enjoy my sleep again I did this on another occasion and again it worked. I started buying more eggs and it became a habit that I practiced for about 6 months. No one had a clue it was me and I even went to the pub and over heard people chatting about eggs being dropped from balconies in the building. Needless to say i used to maintain peace and quiet by dropping eggs from my balconies.",
      "color": "#5e9677",
      "viewCount": 3476
    },
    {
      "title": "Going through a rough time. And now I just ran a red light.",
      "confession": "I ran a red light. It was red for 1-2 seconds. There was one car waiting to turn adjacent to me-I felt I couldn’t brake in time. So I sped up and ran it. I just got off a 10 hour shift at the hospital and I feel horrible/can’t stop thinking about it. I’m already going through a rough time so my anxiety is already at an all time high. Can someone help me feel better? I’d greatly appreciate it.",
      "color": "#c45cb2",
      "viewCount": 7654
    },
    {
      "title": "I thought I was a pretty good dad until I was tested",
      "confession": "My son threw a snowball at me and I instinctively blocked it with my daughter. The look of betrayal on her snow covered face has haunted my dreams for years",
      "color": "#b3fd92",
      "viewCount": 5668
    }
  ]
}
